Repository: Bug-Too/Airwareness2
Catalog: lib/l10n/app_*.arb
Languages: th

source: Search Location
th: ค้นหาสถานที่

source: No location selected
th: ไม่ได้เลือกสถานที่

# unknownLocation
source: Unknown
th: ไม่ทราบชื่อ

source: Settings
th: การตั้งค่า

source: Language
th: ภาษา

source: Sensitive Group
th: กลุ่มเปราะบาง

# sensitiveGroupDesc
source: I have asthma, allergies, or other respiratory conditions.
th: ฉันมีโรคหอบหืด ภูมิแพ้ หรือโรคทางเดินหายใจอื่นๆ

source: General Population
th: คนทั่วไป

# generalPopulationDesc
source: I don't have any specific respiratory sensitivities.
th: ฉันไม่มีปัญหาทางเดินหายใจเป็นพิเศษ

# welcomeTitle
source: Welcome to Airwareness
th: ยินดีต้อนรับสู่ Airwareness

# welcomeSubtitle
source: Let's customize your experience based on your health needs.
th: มาปรับแต่งประสบการณ์การใช้งานตามความต้องการด้านสุขภาพของคุณกันเถอะ

# wearingMask
source: Wear a mask
th: สวมหน้ากาก

source: Close windows
th: ปิดหน้าต่าง

source: Sunscreen
th: ครีมกันแดด

source: Umbrella
th: ร่ม

# airPurifier
source: Air Purifier On
th: เปิดเครื่องฟอกอากาศ

# aqiGood
source: Good
th: ดี

# aqiModerate
source: Moderate
th: ปานกลาง

# aqiUnhealthySensitive
source: Unhealthy for Sensitive Groups
th: ไม่ดีต่อสุขภาพกลุ่มเปราะบาง

# aqiUnhealthy
source: Unhealthy
th: ไม่ดีต่อสุขภาพ

# aqiVeryUnhealthy
source: Very Unhealthy
th: ไม่ดีต่อสุขภาพอย่างมาก

# aqiHazardous
source: Hazardous
th: อันตราย

# actGood
source: It’s a great day to be active outside.
th: วันนี้เป็นวันที่ดีมากสำหรับการทำกิจกรรมกลางแจ้ง

# actModerateGeneral
source: It’s a good day to be active outside.
th: วันนี้เป็นวันที่ดีสำหรับการทำกิจกรรมกลางแจ้ง

# actModerateSensitive
source: Consider making outdoor activities shorter and less intense.
th: ควรพิจารณาลดเวลาและความหนักของกิจกรรมกลางแจ้ง

# actUnhealthySensitiveGeneral
source: It’s a good day to be active outside.
th: วันนี้เป็นวันที่ดีสำหรับการทำกิจกรรมกลางแจ้ง

# actUnhealthySensitiveSensitive
source: Make outdoor activities shorter and less intense. Take more breaks.
th: ควรลดเวลาและความหนักของกิจกรรมกลางแจ้ง และพักให้บ่อยขึ้น

# actUnhealthyGeneral
source: Reduce long or intense activities. Take more breaks.
th: ลดกิจกรรมที่ใช้เวลานานหรือใช้แรงมาก และพักให้บ่อยขึ้น

# actUnhealthySensitive
source: Avoid long or intense outdoor activities. Consider moving indoors.
th: หลีกเลี่ยงกิจกรรมกลางแจ้งที่ใช้เวลานานหรือใช้แรงมาก พิจารณาย้ายไปทำกิจกรรมในร่ม

# actVeryUnhealthyGeneral
source: Avoid long or intense activities. Consider moving indoors.
th: หลีกเลี่ยงกิจกรรมที่ใช้เวลานานหรือใช้แรงมาก พิจารณาย้ายไปทำกิจกรรมในร่ม

# actVeryUnhealthySensitive
source: Avoid all physical activity outdoors. Move activities indoors.
th: หลีกเลี่ยงกิจกรรมทางกายกลางแจ้งทั้งหมด ย้ายไปทำกิจกรรมในร่ม

# actHazardousGeneral
source: Avoid all physical activity outdoors.
th: หลีกเลี่ยงกิจกรรมทางกายกลางแจ้งทั้งหมด

# actHazardousSensitive
source: Remain indoors and keep activity levels low.
th: อยู่ในอาคารและทำกิจกรรมให้น้อยที่สุด
